solidBodyMotion/sphere/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         cellLimited Gauss linear 0.5;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss upwind;
	//div(phi,U)      Gauss linearUpwind grad(U);
	
    turbulence      bounded Gauss upwind;
	//turbulence      Gauss linearUpwind default;
    div(phi,k)			$turbulence;
    div(phi,omega)  	$turbulence;
	div(phi,epsilon)	$turbulence;
	
	div(div(phi,U))	Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    //default         Gauss linear corrected;
	//default         Gauss linear limited 1.0;	//non-ortho < 70
	default         Gauss linear limited 0.5;	//non-ortho 70-80
	//default         Gauss linear limited 0.333;	//non-ortho > 80
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes	//as laplacianSchemes
{
    //default     corrected;
	//default		limited 1.0;
	default		limited	0.5;
	//default		limited	0.333;
}

fluxRequired
{
	default	no;
	p;
}

wallDist
{
    method          meshWave;
}



// ************************************************************************* //
