solidBodyMotion/sphere/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
		maxIter			100;
    }
	pFinal
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.0;
		maxIter			100;
    }
    Phi
    {
        $p;
    }

    "(epsilon|omega|k|U)"
    {
        solver          PBiCGStab;
        preconditioner	DILU;
        tolerance       1e-8;
        relTol          0.01;
        maxIter         100;
    }
	"(epsilon|omega|k|U)Final"
    {
        solver          PBiCGStab;
        preconditioner	DILU;
        tolerance       1e-8;
        relTol          0.0;
        maxIter         100;
    }
}

SIMPLE
{
    momentumPredictor			yes;
	nNonOrthogonalCorrectors 	2;
    consistent 					no;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
	{
		p				0.3;
	}
	equations
    {
        U               0.7;
        k               0.7;
        "(epsilon|omega)" 0.7;
    }
}

fluxRequired
{
	p;
}

// ************************************************************************* //
