solidBodyMotion/sphere/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    sphereCellSet;
        type    cellSet;
        action  new;
        source  sphereToCell;
        origin   (0 0 0);
        radius  2;
    }

    {
        name    sphere0;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     sphereCellSet;
    }
);


// ************************************************************************* //
